[
    {
      "id": 1,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/X4nWNyz/chater.webp",
      "review": "A classic coming-of-age novel that resonates with authenticity and teenage rebellion. It offers a raw portrayal of the protagonist's inner turmoil amidst societal expectations, making it a timeless piece of literature. Salinger's masterful narrative captures the essence of adolescence, evoking both empathy and introspection in readers.",
      "totalPages": 554,
      "rating": 4.3,
      "category": "Fiction",
      "tags":"Fiction",
      "tag":"Romance",
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "id": 2,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/w76TJPJ/the-great.jpg",
      "review": "An iconic portrayal of the Jazz Age, filled with glamour, tragedy, and unfulfilled dreams. Fitzgerald's prose paints a vivid picture of the roaring twenties, exploring themes of love, wealth, and disillusionment. Through the enigmatic Jay Gatsby, the novel delves into the complexities of the American Dream and the pursuit of happiness.",
      "totalPages": 350,
      "rating": 4.5,
      "category": "Fiction",
      "tags": "Drama",
      "tag": "Fantasy",
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "id": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/KKX496t/to-kill.jpg",
      "review": "A poignant exploration of racial injustice, innocence, and the moral growth of its characters. Harper Lee's masterpiece confronts readers with the harsh realities of prejudice and discrimination in the deep South. Through the eyes of Scout Finch, the novel offers profound insights into empathy, compassion, and the quest for justice.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": "Classics",
      "tag": "Fiction",
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "id": 4,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/SxYnK3H/1984.webp",
      "review": "A chilling dystopian narrative that serves as a cautionary tale about totalitarianism and surveillance. Orwell's prophetic vision of a totalitarian regime remains eerily relevant today, prompting readers to reflect on the fragility of freedom and the dangers of unchecked power. Winston Smith's struggle for individuality amidst a dystopian society captivates and terrifies in equal measure.",
      "totalPages": 728,
      "rating": 4.7,
      "category": "Fiction",
      "tags": "Satire",
      "tag": "Action",
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "id": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/s9FFfX1/pride.webp",
      "review": "A delightful comedy of manners that explores themes of love, marriage, and social hierarchy. Austen's wit and satire shine through in this timeless classic, as she navigates the intricacies of Regency-era society. Through the spirited Elizabeth Bennet and the proud Mr. Darcy, the novel offers a charming and enduring portrayal of romance and societal norms.",
      "totalPages": 479,
      "rating": 4.6,
      "category": "Fiction",
      "tags":  "Romance", 
      "tag":  "Dramatic", 
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "id": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/0s4Z0Tx/habit.jpg",
      "review": "An enchanting adventure that introduces readers to the magical world of Middle-earth. Tolkien's whimsical tale of Bilbo Baggins' unexpected journey captivates readers with its rich mythology and endearing characters. From encounters with trolls to riddles with Gollum, the novel brims with excitement and wonder, laying the foundation for the epic saga of 'The Lord of the Rings'.",
      "totalPages": 310,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": "Adventure", 
      "tag": "Fantasy", 
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "id": 7,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/2YHmLYQ/lord.jpg",
      "review": "A monumental epic that follows the journey of a disparate group to destroy a powerful ring and save Middle-earth. Tolkien's magnum opus transports readers to a world of unparalleled imagination and depth, where courage, friendship, and sacrifice are tested against the forces of darkness. 'The Lord of the Rings' remains a timeless testament to the power of storytelling and the triumph of good over evil.",
      "totalPages": 1078,
      "rating": 4.8,
      "category": "Fantasy",
      "tags":"Epic Fantasy",
      "tag":"Epic ",
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "id": 8,
      "bookName": "Harry Potter",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co/S6yQLxh/harry.jpg",
      "review": "An enchanting start to a beloved series, full of magic, friendship, and adventure. Rowling's imaginative world of Hogwarts and its young wizard protagonist, Harry Potter, has captured the hearts of millions worldwide. With themes of bravery, loyalty, and the power of love, this first installment sets the stage for an epic journey into the wizarding world.",
      "totalPages": 223,
      "rating": 4.7,
      "category": "Fantasy",
      "tags":"Magic",
      "tag":"Satire",
      "publisher": "Bloomsbury Publishing",
      "yearOfPublishing": 1997
    },
    {
        "id": 9,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/ZfzrcsN/9b67659347819-560ccddb693ab.jpg",
        "review": "A gripping dystopian tale that explores themes of survival, sacrifice, and rebellion. Collins' narrative thrusts readers into a ruthless world where the oppressed fight for their lives in a twisted spectacle of entertainment. Through the courageous protagonist, Katniss Everdeen, the novel navigates moral ambiguity and the human spirit's resilience in the face of adversity. With its adrenaline-pumping action and thought-provoking social commentary, 'The Hunger Games' captivates audiences of all ages, leaving a lasting impact on the dystopian genre.",
        "totalPages": 674,
        "rating": 4.4,
        "category": "Science Fiction",
        "tags":  "Young Adult", 
        "tag":  "18+", 
        "publisher": "Scholastic Corporation",
        "yearOfPublishing": 2008
      }
    ]
    
  